app/controllers/addresses_controller.rb

SELECT * FROM "addresses"
---
  def index
    @addresses = Address.all

SELECT * FROM "addresses" WHERE ("addresses"."id" = 1)
---
  def show
    @address = Address.find(params[:id])

INSERT INTO "addresses" ("company", "address", "created_at", "notes", "updated_at", "fax", "phone", "web", "email") VALUES(E'Teknik Padu Sdn Bhd', E'3&5, Jalan 24/56
---
  def create
    @address = Address.new(params[:address])

    respond_to do |format|
      if @address.save