app/controllers/components_controller.rb

SELECT * FROM "components" WHERE (component_code ILIKE E'%kapal%' or name ILIKE E'%kapal%') ORDER BY component_code
---
  def index
    @components = Component.search(params[:search])

SELECT * FROM "components" WHERE ("components"."id" = 0)
---
  def show
    @component = Component.find(params[:id])

SELECT * FROM "components" WHERE ("components"."id" = 2)
---
  def edit
    @component = Component.find(params[:id])

INSERT INTO "components" ("name", "manufacturer_id", "serial_no", "created_at", "unit_id", "updated_at", "created_by", "installed_on", "parent_id", "location_id", "supplier_id", "component_code", "type_no", "tech_description", "counter_id") VALUES(E'Close Range Gun', NULL, E'', '2011-04-27 10:26:49.840744', NULL, '2011-04-27 10:26:49.840744', NULL, '2011-04-27', NULL, NULL, NULL, E'A0101', E'DS30B', E'', NULL) RETURNING "id"
---
  def create
    @component = Component.new(params[:component])

    respond_to do |format|
      if @component.save

SELECT * FROM "components" WHERE ("components"."id" = 2)
UPDATE "components" SET "location_id" = 1, "serial_no" = 'ABCD1234', "type_no" = '1466', "updated_at" = '2012-09-23 20:50:23.894734', "tech_description" = 'Technical Description', "manufacturer_id" = 3, "supplier_id" = 4, "installed_on" = '2012-01-07' WHERE "id" = 36
---
  def update
    @component = Component.find(params[:id])

    respond_to do |format|
      if @component.update_attributes(params[:component])

SELECT * FROM "components" WHERE (components.ancestry like E'1/%' or components.ancestry = E'1')
DELETE FROM "components" WHERE "id" = 1
---
  def destroy
    @component = Component.find(params[:id])
    @component.destroy

SELECT * FROM "components" ORDER BY component_code
---
  def indextree
    @components = Component.search(params[:search])