app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT * FROM "documents"

  def show
    @document = Document.find(params[:id])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 2)

  def edit
    @document = Document.find(params[:id])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 2)

  def update
    @document = Document.find(params[:id])

    respond_to do |format|
      if @document.update_attributes(params[:document])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 2)
UPDATE "documents" SET "updated_at" = '2012-01-24 08:02:02.758165', "title" = E'Thales Handbook for the TMCS, CO-Display Manual. ', "doc_code" = E'8649 903 420XX' WHERE "id" = 2