app/controllers/jobdescs_controller.rb

  def index
    @jobdescs = Jobdesc.all
---
SELECT * FROM "jobdescs"

  def show
    @jobdesc = Jobdesc.find(params[:id])
---
SELECT * FROM "jobdescs" WHERE ("jobdescs"."id" = 1)

  def edit
    @jobdesc = Jobdesc.find(params[:id])
---
SELECT * FROM "jobdescs" WHERE ("jobdescs"."id" = 1)

  def create
    @jobdesc = Jobdesc.new(params[:jobdesc])

    respond_to do |format|
      if @jobdesc.save
---
INSERT INTO "jobdescs" ("created_at", "method", "updated_at", "job_code", "description") VALUES('2012-01-22 11:04:41.948623', NULL, '2012-01-22 11:04:41.948623', 5467, E'1. Test Job Description

  def update
    @jobdesc = Jobdesc.find(params[:id])

    respond_to do |format|
      if @jobdesc.update_attributes(params[:jobdesc])
---
SELECT * FROM "jobdescs" WHERE ("jobdescs"."id" = 1)
UPDATE "jobdescs" SET "updated_at" = '2012-01-22 11:07:09.402791', "method" = E'1. Test Job Description