app/controllers/locations_controller.rb

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 6)

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("name", "created_at", "code", "ancestry", "updated_at", "department_id") VALUES(E'Bangunan Hospital Utama', '2011-06-13 08:54:15.679165', NULL, NULL, '2011-06-13 08:54:15.679165', NULL) RETURNING "id"

  def destroy
    @location = Location.find(params[:id])
    @location.destroy
---
SELECT * FROM "locations" WHERE (locations.ancestry like E'1/%' or locations.ancestry = E'1')
DELETE FROM "locations" WHERE "id" = 2