app/controllers/maintenances_controller.rb

SELECT * FROM "maintenances"
---
  def index
    @maintenances = Maintenance.all

SELECT * FROM "maintenances" WHERE ("maintenances"."id" = 1)
---
  def show
    @maintenance = Maintenance.find(params[:id])

SELECT * FROM "maintenances" WHERE ("maintenances"."id" = 3)
---
  def edit
    @maintenance = Maintenance.find(params[:id])

INSERT INTO "maintenances" ("created_at", "code", "updated_at", "level", "action_group_id", "next_date", "priority", "description", "frequency", "component_id", "frequency_unit", "first_date") VALUES('2011-05-19 14:48:03.892978', E'1234', '2011-05-19 14:48:03.892978', 3, NULL, NULL, 1, E'Paint Ship', 1, 3, 365, NULL) RETURNING "id"
---
  def create
    @maintenance = Maintenance.new(params[:maintenance])

    respond_to do |format|
      if @maintenance.save