app/controllers/maintgroups_controller.rb

  def index
    @maintgroups = Maintgroup.all
---
SELECT * FROM "maintgroups"

  def show
    @maintgroup = Maintgroup.find(params[:id])
---
SELECT * FROM "maintgroups" WHERE ("maintgroups"."id" = 1)

  def edit
    @maintgroup = Maintgroup.find(params[:id])
---
SELECT * FROM "maintgroups" WHERE ("maintgroups"."id" = 69)

  def create
    @maintgroup = Maintgroup.new(params[:maintgroup])

    respond_to do |format|
      if @maintgroup.save
---
INSERT INTO "maintgroups" ("name", "created_at", "quantity", "updated_at", "rate", "short_name") VALUES(E'Maintenance Team', '2011-06-13 08:27:43.700638', 1, '2011-06-13 08:27:43.700638', NULL, E'PCM') RETURNING "id"