app/controllers/orgcharts_controller.rb

  def index
    @orgcharts = Orgchart.all
---
SELECT * FROM "orgcharts"

  def show
    @orgchart = Orgchart.find(params[:id])
---
SELECT * FROM "orgcharts" WHERE ("orgcharts"."id" = 1)

  def create
    @orgchart = Orgchart.new(params[:orgchart])

    respond_to do |format|
      if @orgchart.save
---
INSERT INTO "orgcharts" ("name", "created_at", "code", "ancestry", "updated_at") VALUES(E'Jabatan Pesakit Luar', '2011-06-15 06:28:00.982494', NULL, E'1', '2011-06-15 06:28:00.982494') RETURNING "id"