app/controllers/parts_controller.rb

  def index
    @parts = Part.all
---
SELECT * FROM "parts"

  def show
    @part = Part.find(params[:id])
---
SELECT * FROM "parts" WHERE ("parts"."id" = 1)

  def edit
    @part = Part.find(params[:id])
---
SELECT * FROM "parts" WHERE ("parts"."id" = 4)

  def create
    @part = Part.new(params[:part])

    respond_to do |format|
      if @part.save
---
INSERT INTO "parts" ("name", "manufacturer_id", "price", "created_at", "notes", "updated_at", "part_no", "part_code", "supplier_id", "location_id", "tool_class") VALUES(E'Test Part', 1, 25.0, '2011-05-19 19:27:41.537105', E'', '2011-05-19 19:27:41.537105', E'A2416savbs678', E'001', NULL, NULL, NULL) RETURNING "id"