app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT * FROM "roles"

  def show
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 1)

  def edit
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 3)

  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("name", "created_at", "updated_at", "authname") VALUES(E'Maintenance Editor', '2011-04-25 09:13:39.328619', '2011-04-25 09:13:39.328619', E'maintenance_editor') RETURNING "id"

  def update
    @role = Role.find(params[:id])

    respond_to do |format|
      if @role.update_attributes(params[:role])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 2)
UPDATE "roles" SET "updated_at" = '2011-04-20 09:09:53.069019', "authname" = E'administrator' WHERE "id" = 2

  def destroy
    @role = Role.find(params[:id])
    @role.destroy
---
SELECT * FROM "roles" WHERE ("roles"."id" = 1)
DELETE FROM "roles" WHERE "id" = 1