app/controllers/tools_controller.rb

  def index
    @tools = Tool.all
---
SELECT * FROM "tools"

  def show
    @tool = Tool.find(params[:id])
---
SELECT * FROM "tools" WHERE ("tools"."id" = 1)

  def edit
    @tool = Tool.find(params[:id])
---
SELECT * FROM "tools" WHERE ("tools"."id" = 1)

  def update
    @tool = Tool.find(params[:id])

    respond_to do |format|
      if @tool.update_attributes(params[:tool])
---
SELECT * FROM "tools" WHERE ("tools"."id" = 1)
UPDATE "tools" SET "updated_at" = '2012-01-22 05:02:48.555961', "notes" = E'NSCM: H0203', "tool_no" = E'9556 031 034XX' WHERE "id" = 1