app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users= User.find(:all)

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2011-04-18 08:15:58.104502', "name" = E'Yaacob Noor' WHERE "id" = 2
---
  def update
     @user = User.find(params[:id])

     if @user.update_attributes(params[:user])

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES(E'', E'c4a03aa7f1b08aaaf9a64fa2f76dbea881c1c65e', '2011-03-29 17:59:31.506584', E'9790addc924643b0976a4483c92c93118f9ef125', NULL, '2011-03-29 17:59:31.506584', NULL, E'admin', E'consult@teknikpadu.com.my') RETURNING "id"
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save